//! Методы:
let fruits = ['Яблоко', 'Банан', 'Ананас'];
// Кол-во элементов: lenght
// Итерирование по массиву: forEach(item, index, array)
// fruits.forEach(function(item, index, array){
//     console.log(item, index, array)
// });
// Добавление элемент в конец: push('elem')
// Удаление последнего: pop('elem')
// Удаление первого элемен: shift('')
// Поиск номера элемента в массиве: indexOf
// Удаление элементов с определённым индексом: splice(index,count)
// Создание копии массива slice()

// Проверка удовлетворяет ли какой либо элемент условию, заданому
// в передаваемой функции - some()
// Метод reduce((total,value)=> total*value) - этот метод применяет
// функцию к total и каждому значению массива, чтобы получить единственное значен..
// Метод every(), он проверяет удолвлетворяют ли все элементы
// заданному условию и возвращает true or false
// Метод map(), этот метод принимает функцию в качестве параметра
// и создает новый массив на основе указанной функции
// flat(), из двумерного массива делает одномерный
// filter(), принимает функцию в качестве аргумента и возвращает
// новый массив для которого функция true
//sort(a,b)=>a-b, стандартная сортировка
// concat() - объединяет два массива в один новый массив
// fiil(value,star,end) - заполняет массив значениями от старта до енда
// includes() - этот метод проверяет есть ли указанный элемент в массиве
// и возвращает true or false
